# Import modules

In [1]:
import sqlite3
import pandas as pd
import matplotlib.pyplot as plt

DB_NAME = 'olist_db.db'

con = sqlite3.connect(DB_NAME)
cur = con.cursor()
cur.execute('pragma encoding=UTF8')

# Calcul le nombre de clients dans la table des customers

In [4]:
nb_clients_query = """
    SELECT COUNT(DISTINCT customer_unique_id) as nb_customers 
    FROM olist_customers_dataset
"""

clients_count = pd.read_sql(nb_clients_query, con)
clients_count

   nb_customers
0         96096

# Calcul du nombre de produits dans la table des products

In [4]:
nb_products_query = """
    SELECT COUNT(product_id) as nb_products
    FROM olist_products_dataset
"""

products_count = pd.read_sql(nb_products_query, con)
products_count

   nb_products
0        32951

# Calcul du nombre de produits par catégorie

In [66]:
nb_products_by_cat_query = """
    SELECT COUNT(p.product_id) as nb_products, product_category_name_english AS category
    FROM olist_products_dataset AS p
    INNER JOIN product_category_name_translation AS t
    ON p.product_category_name = t.product_category_name
    GROUP BY category
    ORDER BY nb_products DESC
"""



products_by_cat = pd.read_sql(nb_products_by_cat_query,con)
products_by_cat

    nb_products                   category
0          3029             bed_bath_table
1          2867             sports_leisure
2          2657            furniture_decor
3          2444              health_beauty
4          2335                 housewares
..          ...                        ...
66            9     tablets_printing_image
67            5             home_comfort_2
68            5  fashion_childrens_clothes
69            2      security_and_services
70            1          cds_dvds_musicals

[71 rows x 2 columns]

# Calcul du nombre de commandes dans la table orders

In [6]:
nb_orders_query = """
    SELECT COUNT(order_id) as nb_orders
    FROM olist_orders_dataset
"""

nb_orders = pd.read_sql(nb_orders_query,con)
nb_orders

   nb_orders
0      99441

# Calcul du nombre de commandes par status

In [8]:
nb_order_by_status_query = """
    SELECT COUNT(order_id) as nb_orders, order_status
    FROM olist_orders_dataset
    GROUP BY order_status
    ORDER BY nb_orders DESC
"""

nb_order_by_status = pd.read_sql(nb_order_by_status_query,con)
nb_order_by_status

   nb_orders order_status
0      96478    delivered
1       1107      shipped
2        625     canceled
3        609  unavailable
4        314     invoiced
5        301   processing
6          5      created
7          2     approved

# Calcul du nombre de commandes par mois

In [10]:
nb_order_by_month_query = """
    SELECT strftime('%Y-%m', order_approved_at) AS date,
    COUNT(order_id) AS order_by_month
    FROM olist_orders_dataset
    GROUP BY date
    ORDER BY date
"""

nb_order_by_month = pd.read_sql(nb_order_by_month_query,con)
nb_order_by_month

       date  order_by_month
0      None             160
1   2016-09               1
2   2016-10             320
3   2016-12               1
4   2017-01             760
5   2017-02            1765
6   2017-03            2689
7   2017-04            2374
8   2017-05            3693
9   2017-06            3252
10  2017-07            3974
11  2017-08            4348
12  2017-09            4301
13  2017-10            4590
14  2017-11            7395
15  2017-12            5832
16  2018-01            7187
17  2018-02            6706
18  2018-03            7288
19  2018-04            6778
20  2018-05            7066
21  2018-06            6164
22  2018-07            6176
23  2018-08            6620
24  2018-09               1

# Calcul du prix moyen d'une commande

In [12]:
mean_order_query = """
    SELECT AVG(payment_value) AS mean_orders
    FROM olist_order_payments_dataset
"""

mean_order = pd.read_sql(mean_order_query,con)
mean_order

   mean_orders
0    154.10038

# Calcul du score de satisfaction moyen (note moyenne sur les commandes)

In [10]:
mean_score_query = """
    SELECT AVG(review_score) as mean_reviews_score
    FROM olist_order_reviews_dataset
"""

mean_score = pd.read_sql(mean_score_query,con)
mean_score

   mean_reviews_score
0            4.073296

# Calcul de nombre de vendeurs dans la table sellers

In [13]:
nb_sellers_query = """
    SELECT COUNT(DISTINCT seller_id) as nb_sellers
    FROM olist_sellers_dataset
"""

nb_sellers = pd.read_sql(nb_sellers_query,con)
nb_sellers

   nb_sellers
0        3095

# Calcul du nombre de vendeurs par region

In [15]:
nb_sellers_by_state_query = """
    SELECT COUNT(seller_id) as nb_sellers, seller_state
    FROM olist_sellers_dataset
    GROUP BY seller_state
    ORDER BY nb_sellers DESC
"""

nb_sellers_by_state = pd.read_sql(nb_sellers_by_state_query, con)
nb_sellers_by_state

    nb_sellers seller_state
0         1849           SP
1          349           PR
2          244           MG
3          190           SC
4          171           RJ
5          129           RS
6           40           GO
7           30           DF
8           23           ES
9           19           BA
10          13           CE
11           9           PE
12           6           PB
13           5           RN
14           5           MS
15           4           MT
16           2           SE
17           2           RO
18           1           PI
19           1           PA
20           1           MA
21           1           AM
22           1           AC

# Calcul de la quantité de produits vendu par categorie

In [24]:
qty_sold_products_by_cat_query = """
    SELECT (COUNT(o.product_id) * o.order_item_id) AS nb_sold_product, p.product_category_name AS category
    FROM olist_order_items_dataset AS o
    INNER JOIN olist_products_dataset AS p
    ON p.product_id = o.product_id
    GROUP BY category
    ORDER BY nb_sold_product DESC
"""

qty_sold_products_by_cat = pd.read_sql(qty_sold_products_by_cat_query, con)
qty_sold_products_by_cat
# qty_sold_products_by_cat.nb_sold_product.sum()

    nb_sold_product                       category
0              9311                cama_mesa_banho
1              8796                   beleza_saude
2              7681                  esporte_lazer
3              6660         informatica_acessorios
4              6355               moveis_decoracao
..              ...                            ...
69               12                     la_cuisine
70               12              cds_dvds_musicais
71                8  fashion_roupa_infanto_juvenil
72                7                       pc_gamer
73                2             seguros_e_servicos

[74 rows x 2 columns]

# Calcul du nombre de commandes par jour

In [31]:
nb_order_by_day_query = """
    SELECT strftime('%Y-%m-%d', order_approved_at) as date,
    COUNT(order_id) as nb_orders
    FROM olist_orders_dataset
    GROUP BY date
    ORDER BY date
"""

nb_order_by_day_query_2 = """
    SELECT WEEKDAY(order_approved_at) as date,
    COUNT(order_id) as nb_orders
    FROM olist_orders_dataset
    GROUP BY date
    ORDER BY date
"""

nb_order_by_day = pd.read_sql(nb_order_by_day_query_2, con)
nb_order_by_day

   date  nb_orders
0  None        160
1     0       9014
2     1      13001
3     2      19154
4     3      15786
5     4      15471
6     5      14659
7     6      12196

# Calcul du nombre de commandes par jour de la semaine

In [33]:
nb_order_by_weekday_query = """
    SELECT strftime('%w', order_approved_at) as date,
    COUNT(order_id) as nb_orders
    FROM olist_orders_dataset
    GROUP BY date
    ORDER BY date
"""

nb_order_by_weekday = pd.read_sql(nb_order_by_weekday_query, con)
nb_order_by_weekday

   date  nb_orders
0  None        160
1     0       9014
2     1      13001
3     2      19154
4     3      15786
5     4      15471
6     5      14659
7     6      12196

# Calcul de la durée moyenne entre la commande et la livraison

In [37]:
mean_time_delivery_order_query = """
    SELECT AVG(julianday(order_delivered_customer_date) - julianday(order_approved_at)) AS mean_time
    FROM olist_orders_dataset
    WHERE julianday(order_delivered_customer_date) > 0
"""

mean_time_delivery_order = pd.read_sql(mean_time_delivery_order_query, con)
mean_time_delivery_order

   mean_time
0  12.130357

# Calcul du nombre de commandes par ville (Ville de la personne qui commande)

In [24]:
nb_orders_by_city_query = """
    SELECT COUNT(order_id) as nb_orders, customer_city
    FROM olist_orders_dataset 
    INNER JOIN olist_customers_dataset
    ON olist_orders_dataset.customer_id = olist_customers_dataset.customer_id
    GROUP BY customer_city
    ORDER BY nb_orders DESC
"""

nb_orders_by_city = pd.read_sql(nb_orders_by_city_query,con)
nb_orders_by_city

      nb_orders   customer_city
0         14971       sao paulo
1          6611  rio de janeiro
2          2671  belo horizonte
3          2066        brasilia
4          1462        curitiba
...         ...             ...
4113          1         acucena
4114          1           acari
4115          1       acajutiba
4116          1   abdon batista
4117          1       abadiania

[4118 rows x 2 columns]

# Calcul du prix minimum d'une commande

In [27]:
min_price_query = """
    SELECT MIN(payment_value) as min_price, order_id
    FROM olist_order_payments_dataset
"""

min_price = pd.read_sql(min_price_query, con)
min_price

   min_price                          order_id
0        0.0  8bcbe01d44d147f901cd3192671144db

# Calcul du prix maximum d'une commande

In [40]:
max_price_query = """
    SELECT MAX(payment_value) as max_price, order_id
    FROM olist_order_payments_dataset
"""

max_price = pd.read_sql(max_price_query, con)
max_price

   max_price                          order_id
0   13664.08  03caa2c082116e1d31e67e9ae3700499

# Calcul du temps moyen d'une livraison par mois (en jour)

In [39]:
mean_time_by_month_query = """
    SELECT AVG(julianday(order_delivered_customer_date) - julianday(order_approved_at)) AS delivery_time,
    strftime('%Y-%m', order_approved_at) as date
    FROM olist_orders_dataset
    WHERE order_status = 'delivered'
    GROUP BY date
    ORDER BY date
"""

mean_time_by_month = pd.read_sql(mean_time_by_month_query,con)
mean_time_by_month

    delivery_time     date
0             NaN     None
1       54.813194  2016-09
2       18.728340  2016-10
3        4.682720  2016-12
4       12.184679  2017-01
5       12.677815  2017-02
6       12.750773  2017-03
7       14.349227  2017-04
8       10.931291  2017-05
9       11.640613  2017-06
10      11.244028  2017-07
11      10.695455  2017-08
12      11.392023  2017-09
13      11.482595  2017-10
14      14.603762  2017-11
15      15.064361  2017-12
16      13.624642  2018-01
17      16.420525  2018-02
18      16.064638  2018-03
19      10.904454  2018-04
20      11.016311  2018-05
21       8.913337  2018-06
22       8.407024  2018-07
23       7.377900  2018-08

# Calcul du nombre de commandes par ville du vendeur

In [62]:
nb_orders_by_seller_city_query = """
SELECT COUNT(o.order_id) AS number, s.seller_city AS city
FROM olist_order_items_dataset AS o
INNER JOIN olist_sellers_dataset AS s
ON s.seller_id = o.seller_id
GROUP BY city
ORDER BY number DESC
"""
nb_orders_by_seller_city = pd.read_sql(nb_orders_by_seller_city_query, con)
# nb_orders_by_seller_city.city.isin(['rio de janeiro']).any()
nb_orders_by_seller_city

     number                 city
0     24416            sao paulo
1      6480             ibitinga
2      2688          santo andre
3      2684             curitiba
4      2392       belo horizonte
..      ...                  ...
606       1    angra dos reis rj
607       1  almirante tamandare
608       1      aguas claras df
609       1      abadia de goias
610       1             04482255

[611 rows x 2 columns]